Repository: xiaotwu/food-shelfie
Catalog: Shared/Localizable.xcstrings
Source language: en_us
Languages: zh_hans

# about.designRow
source: Apple Liquid Glass
zh_hans: Apple Liquid Glass 流光玻璃

# about.feature.scan
source: Scan barcodes & expiry dates
zh_hans: 扫描条形码与保质期

# about.feature.track
source: Track freshness across shelves
zh_hans: 跨货架追踪新鲜度

# about.feature.widgets
source: Widgets & smart reminders
zh_hans: 小组件与智能提醒

# about.features
source: Features
zh_hans: 功能亮点

# about.madeWith
source: Made with
zh_hans: 技术支持

# about.privacyRow
source: Stored on your device by default. Optional iCloud sync uses your Apple account. Barcode lookup sends the barcode to Open Food Facts and downloads product photos. No ads or tracking.
zh_hans: 默认保存在设备上。可选 iCloud 同步使用你的 Apple 账户。条码查询会将条码发送至 Open Food Facts 并下载商品照片。无广告或追踪。

# about.tagline
source: Smart freshness & kitchen expiry tracking.
zh_hans: 智能厨房保质期与新鲜度追踪工具。

# about.version
source: Version
zh_hans: 版本

# category.dairyEggs
source: Dairy & eggs
zh_hans: 乳制品和蛋

# category.fruits
source: Fruit
zh_hans: 水果

# category.meat
source: Meat
zh_hans: 肉类

# category.others
source: Other
zh_hans: 其他

# category.seafood
source: Seafood
zh_hans: 海鲜

# category.uncategorized
source: Uncategorized
zh_hans: 未分类

# category.vegetables
source: Vegetables
zh_hans: 蔬菜

# color.amethyst
source: Amethyst
zh_hans: 紫晶

# color.emerald
source: Emerald
zh_hans: 翠绿

# color.ruby
source: Ruby
zh_hans: 朱红

# color.sapphire
source: Sapphire
zh_hans: 宝石蓝

# color.topaz
source: Topaz
zh_hans: 琥珀

# common.ok
source: OK
zh_hans: 好

source: Count
zh_hans: 数量

source: Day
zh_hans: 日期

# days.expiredAgo
source: Expired %lld days ago
zh_hans: 已过期 %lld 天

# days.expiredAgoShort
source: Expired %lldd ago
zh_hans: 过期 %lld 天

# days.none
source: No expiry date
zh_hans: 未设置到期日

# days.one
source: 1 day left
zh_hans: 剩余 1 天

# days.other
source: %lld days left
zh_hans: 剩余 %lld 天

# days.today
source: Expires today
zh_hans: 今天到期

# detail.boughtOn
source: Bought on
zh_hans: 购入日期

# detail.discard
source: Discard
zh_hans: 丢弃

# detail.eaten
source: Mark as eaten
zh_hans: 已食用

# detail.edit
source: Edit
zh_hans: 编辑

# detail.expiresOn
source: Expires on
zh_hans: 到期日

# detail.notes
source: Notes
zh_hans: 备注

# detail.unknown
source: Unknown
zh_hans: 未知

source: Discarded
zh_hans: 丢弃

# Eaten
source: Consumed
zh_hans: 食用

# entry.add
source: Add
zh_hans: 添加

# entry.addTitle
source: Add item
zh_hans: 添加食品

# entry.cancel
source: Cancel
zh_hans: 取消

# entry.category
source: Category
zh_hans: 分类

# entry.categoryName
source: Category name
zh_hans: 分类名称

# entry.dates
source: Dates
zh_hans: 日期

# entry.editTitle
source: Edit item
zh_hans: 编辑食品

# entry.expiry
source: Expiry date
zh_hans: 到期日

# entry.location
source: Location
zh_hans: 位置

# entry.name
source: Item name
zh_hans: 食品名称

# entry.newCategory
source: New category
zh_hans: 新建分类

# entry.notes
source: Notes
zh_hans: 备注

# entry.notesPlaceholder
source: Optional notes
zh_hans: 可选备注

# entry.photo
source: Photo
zh_hans: 照片

# entry.photoHint
source: Optional. Choose from your library.
zh_hans: 可选，从相册选取。

# entry.purchased
source: Purchase date
zh_hans: 购入日期

# entry.quickDays3
source: +3 Days
zh_hans: +3 天

# entry.quickExpiry
source: Quick Expiry
zh_hans: 快速设置到期日

# entry.quickMonth1
source: +1 Month
zh_hans: +1 个月

# entry.quickWeek1
source: +1 Week
zh_hans: +1 周

# entry.quickWeeks2
source: +2 Weeks
zh_hans: +2 周

# entry.save
source: Save
zh_hans: 保存

# entry.storage
source: Storage
zh_hans: 存放位置

# freshness.expired
source: Expired
zh_hans: 已过期

# freshness.fresh
source: Fresh
zh_hans: 新鲜

# freshness.urgent
source: Use promptly
zh_hans: 尽快食用

# freshness.warning
source: Use soon
zh_hans: 即将到期

# insights.discarded
source: Discarded
zh_hans: 已丢弃

# insights.eaten
source: Eaten
zh_hans: 已食用

# insights.eatenVsDiscarded
source: Eaten vs discarded
zh_hans: 食用与丢弃

# insights.efficiency.subtitle
source: Eaten batches ÷ eaten and discarded batches in this period. This does not measure food weight or savings.
zh_hans: 本期吃完批次 ÷ 吃完与丢弃批次总数，不代表实际重量或节省金额。

# insights.efficiency.title
source: Recorded batches eaten
zh_hans: 已记录批次的吃完比例

# insights.expired
source: Expired
zh_hans: 已过期

# insights.expiringWeek
source: Expiring this week
zh_hans: 本周到期

# insights.freshnessEmpty
source: Mark items as eaten or discarded to see this chart.
zh_hans: 将食品标记为已食用或已丢弃后，即可查看此图表。

# insights.freshnessHistory
source: How items were used
zh_hans: 食用情况

# insights.period.month
source: 30 days
zh_hans: 近 30 天

# insights.period.week
source: 7 days
zh_hans: 近 7 天

# insights.title
source: Insights
zh_hans: 概况

# insights.weekChart
source: Expiring this week
zh_hans: 本周到期分布

# Kind
source: Type
zh_hans: 类型

# language.chinese
source: Simplified Chinese
zh_hans: 简体中文

# language.english
source: English
zh_hans: 英文

# language.system
source: System
zh_hans: 跟随系统

# location.all
source: All
zh_hans: 全部

# location.freezer
source: Freezer
zh_hans: 冷冻

# location.fridge
source: Fridge
zh_hans: 冷藏

source: Location name
zh_hans: 位置名称

# location.new
source: New location
zh_hans: 新建位置

# location.other
source: Other
zh_hans: 其他

# location.pantry
source: Pantry
zh_hans: 常温

# lock.reason
source: Unlock Shelfie
zh_hans: 解锁 Shelfie

# lock.subtitle
source: Unlock to open your shelf.
zh_hans: 解锁后即可查看货架。

# lock.unlock
source: Unlock
zh_hans: 解锁

# notif.checkBody
source: Everything on your shelf looks fine today.
zh_hans: 货架上的食品今天状态良好。

# notif.checkTitle
source: Shelf check
zh_hans: 货架提醒

# notif.expiredTitle
source: Items expire today
zh_hans: 今天有食品到期

# notif.soonTitle
source: Use these soon
zh_hans: 以下食品即将到期

# notif.weeklyBody
source: %lld expired, %lld expiring this week.
zh_hans: %lld 件已过期，%lld 件将于本周到期。

# notif.weeklyTitle
source: Weekly shelf summary
zh_hans: 本周货架摘要

# scanner.barcode
source: Barcode
zh_hans: 条码

# scanner.cameraOff
source: Camera access is turned off.
zh_hans: 未开启相机权限。

# scanner.cameraPolicyBody
source: Shelfie uses the camera only to read barcodes and expiry dates. A product lookup is sent only when you scan a barcode.
zh_hans: Shelfie 仅用相机识别条码和到期日。只有扫描条码时才会查询商品信息。

# scanner.cameraPolicyTitle
source: Camera access
zh_hans: 相机权限

# scanner.cancel
source: Cancel
zh_hans: 取消

# scanner.captureDate
source: Photograph the expiry date
zh_hans: 拍摄到期日期

# scanner.close
source: Close
zh_hans: 关闭

# scanner.continue
source: Continue
zh_hans: 继续

# scanner.date
source: Expiry date
zh_hans: 到期日

# scanner.lookingUp
source: Looking up %@…
zh_hans: 正在查询 %@…

# scanner.lookupFailed
source: Couldn’t look up this barcode. Try again.
zh_hans: 条码查询失败，请重试。

# scanner.noDate
source: No date found. Try a closer photo.
zh_hans: 未识别到日期，请靠近后再拍。

# scanner.notFound
source: No product found. You can add it yourself.
zh_hans: 未找到商品，可手动添加。

# scanner.pointBarcode
source: Align a barcode in the frame
zh_hans: 将条码对准取景框

# scanner.readingDate
source: Reading the date…
zh_hans: 正在识别日期…

# scanner.title
source: Scan
zh_hans: 扫描

# search.clear
source: Clear
zh_hans: 清空

# search.emptyHint
source: Search foods by name, owner, notes, category, or location.
zh_hans: 可按食品名称、归属人、备注、分类或存放位置搜索。

# search.expired
source: Expired
zh_hans: 已过期

# search.expiringSoon
source: Expiring Soon
zh_hans: 即将过期

# search.noResults
source: No results found
zh_hans: 无匹配结果

# search.noResultsSubtitle
source: Try searching by another keyword, owner, or category.
zh_hans: 尝试搜索其他关键词、归属人或分类。

# search.prompt
source: Search foods, owner, notes...
zh_hans: 搜索食品、归属人、备注...

# search.quickFilters
source: Quick Filters
zh_hans: 快捷筛选

# search.recent
source: Recent searches
zh_hans: 最近搜索

# search.scope.all
source: All
zh_hans: 全部

# search.scope.category
source: Category
zh_hans: 分类

# search.scope.location
source: Location
zh_hans: 存放位置

# search.scope.name
source: Name
zh_hans: 名称

# search.scope.owner
source: Owner
zh_hans: 归属人

# search.title
source: Search
zh_hans: 搜索

# settings.about
source: About Shelfie
zh_hans: 关于 Shelfie

# settings.aboutBlurb
source: A private expiry tracker for your kitchen. No account, no ads, no tracking.
zh_hans: 面向厨房的保质期追踪工具。无需账户，没有广告，也不收集使用数据。

# settings.accent
source: Accent color
zh_hans: 强调色

# settings.allDeleted
source: All shelf data was deleted.
zh_hans: 已删除全部货架数据。

# settings.appearance
source: Appearance
zh_hans: 外观

# settings.autoDeleteShort
source: Keep resolved records
zh_hans: 保留已处理记录

# settings.backupRestored
source: Backup restored.
zh_hans: 备份已恢复。

# settings.copyright
source: Copyright
zh_hans: 版权

# settings.dailyReminder
source: Daily reminder time
zh_hans: 每日提醒时间

# settings.data
source: Data
zh_hans: 数据

# settings.daysValue
source: %lld days
zh_hans: %lld 天

# settings.deleteAll
source: Delete all data
zh_hans: 删除全部数据

# settings.deleteConfirm
source: Delete all shelf data?
zh_hans: 确定删除全部货架数据？

# settings.enableLock
source: Unlock to turn on lock
zh_hans: 验证身份以开启锁定

# settings.expiryReminders
source: Expiry reminders
zh_hans: 到期提醒

# settings.export
source: Export backup
zh_hans: 导出备份

# settings.groupByCategory
source: Group shelf by category
zh_hans: 按分类排列货架

# settings.iCloud
source: iCloud Sync
zh_hans: iCloud 同步

# settings.iCloudFootnote
source: Off by default. When on, shelf items and photos sync through your iCloud account. Turning it off keeps data on this device only.
zh_hans: 默认关闭。开启后，货架数据和照片会通过你的 iCloud 账号在设备间同步。关闭后数据只留在本机。

# settings.iCloudErrorTitle
source: Couldn’t enable iCloud Sync
zh_hans: 无法开启 iCloud 同步

# settings.iCloudError
source: Check that you are signed in to iCloud on this device, then try again.
zh_hans: 请确认这台设备已登录 iCloud，然后重试。

# settings.import
source: Import backup
zh_hans: 导入备份

# settings.inspired
source: Inspired by Algidy, rebuilt for iPhone.
zh_hans: 功能参考 Algidy，为 iPhone 重新编写。

# settings.keepResolved
source: Keep eaten and discarded items
zh_hans: 保留已食用和已丢弃的记录

# settings.language
source: Language
zh_hans: 语言

# settings.lock
source: Require Face ID or passcode
zh_hans: 使用面容 ID 或密码锁定

# settings.more
source: More
zh_hans: 更多

# settings.notifications
source: Notifications
zh_hans: 通知

# settings.openSource
source: Acknowledgments
zh_hans: 致谢

# settings.privacy
source: Privacy
zh_hans: 隐私

# settings.privacyBody
source: Inventory and photos stay on your device unless you enable iCloud sync. Barcode lookup sends barcodes to Open Food Facts; product images are downloaded from its image provider. Camera and photo OCR run on device. No ads, analytics, or tracking.
zh_hans: 库存与照片默认保存在设备上，启用 iCloud 后通过 Apple 账户同步。条码会发送至 Open Food Facts，商品图片从其图片服务下载。相机与照片文字识别在设备上运行。无广告、分析或追踪。

# settings.removeResolved
source: Remove resolved items after %lld days
zh_hans: %lld 天后清除已处理记录

# settings.theme
source: Theme
zh_hans: 主题

# settings.title
source: Settings
zh_hans: 设置

# settings.warnDays
source: Warn %lld days before expiry
zh_hans: 到期前 %lld 天提醒

# settings.warnDaysShort
source: Warn before expiry
zh_hans: 到期前提醒

# settings.weeklySummary
source: Weekly summary
zh_hans: 每周摘要

# shelf.actions
source: Actions
zh_hans: 操作

# shelf.cancel
source: Cancel
zh_hans: 取消

# shelf.count.one
source: 1 item on your shelf
zh_hans: 货架上有 1 件食品

# shelf.count.other
source: %lld items on your shelf
zh_hans: 货架上有 %lld 件食品

# shelf.count.zero
source: No items yet
zh_hans: 暂无食品

# shelf.delete
source: Delete
zh_hans: 删除

# shelf.empty.action
source: Add item
zh_hans: 添加食品

# shelf.empty.body
source: Add an item or scan a barcode to start tracking expiry dates.
zh_hans: 手动添加食品，或扫描条码，开始跟踪保质期。

# shelf.empty.title
source: Nothing on your shelf yet
zh_hans: 货架还是空的

# shelf.expiredOnly
source: Expired only
zh_hans: 仅显示已过期

# shelf.markDiscarded
source: Mark as discarded
zh_hans: 标记已丢弃

# shelf.markEaten
source: Mark as eaten
zh_hans: 标记已食用

# shelf.search
source: Search
zh_hans: 搜索

# shelf.sort
source: Sort
zh_hans: 排序

# shelf.title
source: Shelf
zh_hans: 货架

# sort.expiry
source: Expiry date
zh_hans: 到期日

# sort.name
source: Name
zh_hans: 名称

# sort.recent
source: Recently added
zh_hans: 最近添加

# tab.insights
source: Insights
zh_hans: 概况

# tab.settings
source: Settings
zh_hans: 设置

# tab.shelf
source: Shelf
zh_hans: 货架

# theme.dark
source: Dark
zh_hans: 深色

# theme.light
source: Light
zh_hans: 浅色

# theme.system
source: System
zh_hans: 跟随系统

# validation.expiryBeforePurchase
source: Expiry date must be on or after the purchase date.
zh_hans: 到期日不能早于购入日期。

# validation.expiryPast
source: Expiry date cannot be in the past.
zh_hans: 到期日不能早于今天。

# validation.purchaseFuture
source: Purchase date cannot be in the future.
zh_hans: 购入日期不能晚于今天。

# validation.required
source: This field is required.
zh_hans: 此项为必填。

# validation.tooShort
source: Enter at least 2 characters.
zh_hans: 至少输入 2 个字符。

# widget.daysShort
source: %lldd
zh_hans: %lld天

# widget.empty
source: Nothing expires this week
zh_hans: 本周没有食品到期

# widget.expiredCount
source: %lld expired
zh_hans: %lld 件已过期

# widget.expiring
source: Expiring
zh_hans: 即将到期

# widget.expiringDesc
source: See what to use this week.
zh_hans: 查看本周需要尽快食用的食品。

# widget.expiringName
source: Expiring items
zh_hans: 即将到期

# widget.freshnessDesc
source: Expiry counts for the week, on your Home Screen.
zh_hans: 在主屏幕查看本周到期数量。

# widget.freshnessName
source: Weekly overview
zh_hans: 本周概况

# widget.soonCount
source: %lld soon
zh_hans: %lld 件即将到期

# widget.thisWeek
source: This week
zh_hans: 本周

# widget.today
source: today
zh_hans: 今天

# entry.owner
source: Owner
zh_hans: 归属人

# entry.ownerPlaceholder
source: Owner name (optional)
zh_hans: 归属人姓名（选填）

# storage.errorTitle
source: Your inventory could not be opened
zh_hans: 无法打开食品库存

# storage.errorBody
source: Your saved data has not been deleted. Try again, or contact support if the problem continues.
zh_hans: 已保存的数据未被删除。请重试；若问题持续，请联系支持。

# storage.retry
source: Try Again
zh_hans: 重试

# settings.importConfirm
source: Replace your inventory with this backup? This replaces all current food, categories, locations, and search history.
zh_hans: 用此备份替换库存？当前食品、分类、位置与搜索历史将被替换。

# about.support
source: Help & Feedback
zh_hans: 帮助与反馈

# detail.quantity
source: Remaining quantity
zh_hans: 剩余数量

# detail.consumePartial
source: Use some
zh_hans: 使用一部分

# detail.consumeAmount
source: Amount used
zh_hans: 使用数量

# detail.consumeHint
source: Enter an amount greater than zero and no more than the remaining quantity.
zh_hans: 请输入大于零且不超过剩余数量的数值。

# detail.repeatPurchase
source: Buy again
zh_hans: 再次购买

# action.undo
source: Undo
zh_hans: 撤销

# action.updated
source: Inventory updated
zh_hans: 库存已更新

# error.saveTitle
source: Could not save
zh_hans: 无法保存

# error.saveMessage
source: Your changes were not saved. Please try again.
zh_hans: 修改未保存，请重试。

# operation.errorTitle
source: Couldn’t complete the action
zh_hans: 操作未完成

# unit.piece
source: pcs
zh_hans: 个

# unit.pack
source: packs
zh_hans: 包

# unit.bottle
source: bottles
zh_hans: 瓶

# unit.gram
source: g
zh_hans: 克

# unit.kilogram
source: kg
zh_hans: 千克

# unit.milliliter
source: mL
zh_hans: 毫升

# unit.liter
source: L
zh_hans: 升

# shelf.deleteConfirmation
source: Delete selected foods? This cannot be undone.
zh_hans: 删除选中的食品？此操作无法撤销。

# entry.saveErrorTitle
source: Could not save
zh_hans: 无法保存

# entry.ok
source: OK
zh_hans: 好

# entry.quantity
source: Quantity
zh_hans: 数量

# entry.unit
source: Unit
zh_hans: 单位

# entry.quantityInvalid
source: Enter a quantity from 0.001 to 1,000,000,000, with up to 3 decimal places.
zh_hans: 请输入 0.001 至 1,000,000,000 之间的数量，最多保留 3 位小数。

# entry.repeatExpiryNotice
source: Check the expiry date on this new purchase. The previous batch’s date has not been copied.
zh_hans: 请核对本次购买的保质期。上一次购买的日期不会沿用。

# entry.confirmExpiry
source: I have confirmed this expiry date
zh_hans: 我已确认本次保质期

# entry.locationSaveError
source: The storage location was not saved. Try adding it again.
zh_hans: 存放位置未保存，请重试。

# entry.categorySaveError
source: The category was not saved. Try adding it again.
zh_hans: 分类未保存，请重试。

# entry.missingFoodError
source: This food no longer exists. Your input has been kept.
zh_hans: 该食品记录已不存在，已保留你的输入。

# entry.photoSaveError
source: The photo could not be saved. Your input has been kept; please try again.
zh_hans: 照片无法保存，已保留你的输入，请重试。

# entry.saveError
source: Your changes were not saved. Your input has been kept; please try again.
zh_hans: 修改未保存，已保留你的输入，请重试。

# action.undoUnavailable
source: This item changed after the action. Undo is no longer available.
zh_hans: 此食品在操作后已被修改，无法再撤销。

# shelf.useFirst
source: Use first
zh_hans: 优先食用

# shelf.useFirstHint
source: Choose a food to see its expiry and update its quantity.
zh_hans: 选择食品查看期限并更新数量。

# history.title
source: Food history
zh_hans: 处理记录

# history.restore
source: Restore to shelf
zh_hans: 恢复到库存

# history.restoreQuantity
source: Quantity to restore
zh_hans: 恢复数量

# history.restoreHint
source: Restoring keeps this batch’s dates. Use Buy again for a new purchase.
zh_hans: 恢复会保留本批次日期，新购食品请使用再次购买。

# history.empty
source: No processed foods yet
zh_hans: 尚无处理记录

# history.eaten
source: Eaten
zh_hans: 已吃完

# history.discarded
source: Discarded
zh_hans: 已丢弃

# shopping.title
source: Shopping list
zh_hans: 购物清单

# shopping.empty
source: Your shopping list is empty
zh_hans: 购物清单为空

# shopping.lowStock
source: Running low
zh_hans: 库存不足

# shopping.add
source: Add to shopping list
zh_hans: 加入购物清单

# shopping.added
source: On shopping list
zh_hans: 已加入购物清单

# shopping.name
source: Item name
zh_hans: 商品名称

# shopping.quantity
source: Quantity to buy
zh_hans: 购买数量

# shopping.remaining
source: Remaining
zh_hans: 剩余

# shopping.bought
source: Bought
zh_hans: 已购买

# entry.opened
source: Opened
zh_hans: 已开封

# entry.openedDate
source: Date opened
zh_hans: 开封日期

# entry.openedDays
source: Use within days after opening
zh_hans: 开封后食用天数

# entry.openedHint
source: The earlier of the package expiry and opened shelf life drives reminders. Check the label; this is your own estimate.
zh_hans: 提醒按包装期限与开封后期限中的较早日期计算，请查看标签，此处期限由你填写。

# entry.openedInvalid
source: Choose an opening date between purchase and today, and 1–365 days.
zh_hans: 开封日期需介于购买日期和今天之间，天数需为 1–365。

# entry.lowStock
source: Track low stock
zh_hans: 跟踪低库存

# entry.lowStockThreshold
source: Low stock threshold
zh_hans: 低库存阈值

# entry.lowStockHint
source: Items at or below this quantity appear in Running low. Add them to your shopping list when needed.
zh_hans: 剩余数量达到或低于此值时显示在库存不足中，可按需加入购物清单。

# entry.lowStockInvalid
source: Enter zero or a positive quantity, up to three decimal places.
zh_hans: 请输入零或正数量，最多三位小数。

# entry.batchHint
source: Each entry is one purchase batch. Keep different expiry dates as separate entries.
zh_hans: 每条记录代表一个购买批次，不同到期日请分开记录。

# detail.packageExpiry
source: Package expiry
zh_hans: 包装到期日

# detail.openedExpiry
source: After opening, use by
zh_hans: 开封后期限

# detail.effectiveExpiry
source: Reminder date
zh_hans: 提醒期限

# history.restoreInvalid
source: Enter a positive quantity, up to three decimal places.
zh_hans: 请输入正数量，最多三位小数。

# food.eaten
source: Mark eaten
zh_hans: 标记吃完

# food.discarded
source: Mark discarded
zh_hans: 标记丢弃

# widget.overdueDays
source: %d d overdue
zh_hans: 已过期 %d 天

# settings.notificationPermission
source: System permission
zh_hans: 系统权限

# settings.openSystemSettings
source: Open system settings
zh_hans: 打开系统设置

# settings.allowNotifications
source: Allow notifications
zh_hans: 允许通知

# settings.notificationPermissionFootnote
source: System permission is separate from Shelfie’s reminder switch. Focus and system notification settings may silence delivery.
zh_hans: 系统通知权限与 Shelfie 的提醒开关分别控制。专注模式和系统通知设置可能让提醒静音。

# settings.permissionAllowed
source: Allowed
zh_hans: 已允许

# settings.permissionQuiet
source: Quiet delivery
zh_hans: 静默送达

# settings.permissionDenied
source: Denied
zh_hans: 已拒绝

# settings.permissionNotRequested
source: Not requested
zh_hans: 尚未请求

# settings.reminderScheduleFootnote
source: Dated foods receive a warning and an expiry reminder at your selected local time. There are no daily check-in reminders for an empty shelf. Weekly summaries are scheduled only around dated foods.
zh_hans: 有日期的食品会在所选本地时间收到临期提醒和到期提醒。空库存不会收到每日检查提醒。周报仅在有日期食品的相关时间安排。

# settings.remindersInactive
source: Reminders are inactive. Enable reminders and allow system notifications to schedule them.
zh_hans: 提醒尚未启用。请开启提醒并允许系统通知后安排提醒。

# settings.reminderCoverage
source: Planned: %d requests covering %d of %d dated batches. Shelfie keeps at most 60 requests, prioritizing the earliest dates. Reopen Shelfie after handling foods to refresh coverage.
zh_hans: 已计划 %d 条通知，覆盖 %d / %d 批有日期食品。Shelfie 最多保留 60 条通知，优先安排较近日期。处理食品后重新打开应用可更新覆盖范围。

# notif.missingFood
source: This food no longer exists. Open your shelf to check the latest inventory.
zh_hans: 此食品已不存在。请打开库存查看最新记录。

# scanner.openSettings
source: Open Camera Settings
zh_hans: 打开相机设置

# scanner.retry
source: Try this barcode again
zh_hans: 重试此条码

# scanner.cancelRequest
source: Cancel lookup
zh_hans: 取消查询

# scanner.enterBarcode
source: Enter barcode
zh_hans: 输入条码

# scanner.addManually
source: Add food manually
zh_hans: 手动添加食品

# scanner.invalidBarcode
source: Enter a valid 8, 12, 13 or 14-digit retail barcode, including its check digit.
zh_hans: 请输入包含校验位的有效 8、12、13 或 14 位商品条码。

# scanner.barcodeDigits
source: Barcode digits
zh_hans: 条码数字

# scanner.manualBarcodeHelp
source: Type the digits printed below the barcode. Spaces are allowed.
zh_hans: 输入条码下方的数字，可以包含空格。

# scanner.lookup
source: Look up product
zh_hans: 查询商品

# scanner.recognizedText
source: Recognized packaging text
zh_hans: 识别到的包装文字

# scanner.confirmDate
source: Confirm expiry date
zh_hans: 确认保质期

# scanner.ambiguousDate
source: More than one date is possible. Check the packaging and choose the correct expiry date.
zh_hans: 日期存在多种解释，请核对包装并选择正确的保质期。

# scanner.correctDate
source: Correct date
zh_hans: 调整日期

# scanner.useConfirmedDate
source: Use confirmed date
zh_hans: 使用已确认的日期

# insights.efficiency.empty
source: No processed batches in this period yet.
zh_hans: 本期暂无已处理批次。

# settings.inventoryBadge.title
source: Inventory badges
zh_hans: 库存气泡提示

# settings.inventoryBadge.number
source: Show numbers
zh_hans: 显示数字

# settings.inventoryBadge.dot
source: Red dot only
zh_hans: 仅显示红点

# settings.inventoryBadge.off
source: Off
zh_hans: 关闭提示

# settings.inventoryBadge.hint
source: Show the number of active food batches on All, storage areas and the Shelf tab. Empty areas have no badge.
zh_hans: 在 All、放置区域和底部 Shelf 导航显示当前库存批次数量；空区域不显示提示。

# shelf.badge.items
source: food batches
zh_hans: 个食品批次

# settings.lockEnableFailed
source: Authentication was not completed. App lock remains off. Try again.
zh_hans: 身份验证未完成，应用锁仍关闭，请重试。

# scanner.photoLoadFailed
source: This photo could not be opened. Try another photo or add food manually.
zh_hans: 无法打开此照片，请重选照片或手动添加食品。

# backup.error.unsupportedVersion
source: Unsupported backup version. Your inventory was not changed.
zh_hans: 不支持此备份版本。库存未发生变化。

# backup.error.duplicateIDs
source: This backup contains duplicate records. Your inventory was not changed.
zh_hans: 备份中存在重复记录。库存未发生变化。

# backup.error.invalidImage
source: A food photo is invalid. No incomplete backup will be exported or restored.
zh_hans: 食品照片无效，无法导出或恢复不完整的备份。

# backup.error.invalidQuantity
source: A quantity is invalid. Check your food and shopping quantities before exporting or restoring.
zh_hans: 存在无效数量。请检查食品和购物清单的数量后再导出或恢复。

# backup.error.invalidReference
source: A food refers to a missing category or location. No backup was exported or restored.
zh_hans: 食品引用的分类或位置不存在。备份未导出或恢复。

# backup.error.invalidOpening
source: Opening dates or stock thresholds are invalid. Check them before exporting or restoring.
zh_hans: 开封日期、开封保质期或低库存阈值无效，请检查后再导出或恢复。

# backup.error.tooLarge
source: Backups support up to 100 MB, 10,000 foods and 10,000 shopping items. Photos support up to 10 MB each and 50 MB in total. No backup was exported or restored.
zh_hans: 备份最多支持 100 MB、10,000 条食品和 10,000 条购物记录。每张照片最多 10 MB，照片总计最多 50 MB。备份未导出或恢复。
